Revit 2027 API
StairsType.NotchHorizontalGap Property
 The width of the horizontal gap in the stairs notch.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NotchHorizontalGap { get; set; }
Public Property NotchHorizontalGap As Double
	Get
	Set
public:
property double NotchHorizontalGap {
	double get ();
	void set (double value);
}
member NotchHorizontalGap : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for notchHorizontalGap must be between 0 and 30000 feet.
InvalidOperationException |  When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace